wemakerspace/ch55xduino/ch55xduino/ch55x/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.upload_method=Upload method
##############################################################

ch552.name=CH552 Board

#ch552.upload.tool=stm8flash
#ch552.upload.protocol=stlinkv2
#ch552.upload.mcu=stm8s103?3
#CH552 has 16K flash
ch552.upload.maximum_size=16384
#no USB yet
ch552.upload.maximum_data_size=1024

#ch552.bootloader.tool=stm8flash

ch552.build.mcu=mcs51
ch552.build.f_cpu=16000000L
ch552.build.board=ch55x
ch552.build.core=ch55xduino
ch552.build.variant=standard
ch552.build.extra_flags=--model-small

# meaningless variables just to keep the makefile happy

ch552.upload.speed=1
